In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
pwd = os.getcwd()

In [3]:
connection = sqlite3.connect('/Users/User/Desktop/DA Course (Cliff)/Lesson 2-20210305T150536Z-001/Lesson 2/datasets/sql/Cars.db.sqlite')

In [4]:
model = pd.read_csv('/Users/User/Desktop/DA Course (Cliff)/Lesson 2-20210305T150536Z-001/Lesson 2/datasets/csv/car-model.csv', encoding = 'utf-8')

model.to_sql(name = 'car_model', con = connection, if_exists = 'replace', index = False)

In [5]:
data = pd.read_csv('/Users/User/Desktop/DA Course (Cliff)/Lesson 2-20210305T150536Z-001/Lesson 2/datasets/csv/car-data.csv', encoding = 'utf-8')

data.to_sql(name = 'car_data', con = connection, if_exists = 'replace', index = False)

In [6]:
brand = pd.read_csv('/Users/User/Desktop/DA Course (Cliff)/Lesson 2-20210305T150536Z-001/Lesson 2/datasets/csv/car-brand.csv', encoding = 'utf-8')

brand.to_sql(name = 'car_brand', con = connection, if_exists = 'replace', index = False)

In [7]:
model.head()

   Id        Brand                        Model
0   1  'chevrolet'  'chevrolet chevelle malibu'
1   2      'buick'          'buick skylark 320'
2   3   'plymouth'         'plymouth satellite'
3   4        'amc'              'amc rebel sst'
4   5       'ford'                'ford torino'

In [8]:
pd.read_sql('SELECT * FROM car_model LIMIT 5', con = connection)

   Id        Brand                        Model
0   1  'chevrolet'  'chevrolet chevelle malibu'
1   2      'buick'          'buick skylark 320'
2   3   'plymouth'         'plymouth satellite'
3   4        'amc'              'amc rebel sst'
4   5       'ford'                'ford torino'

## Adding values into SQL table

In [9]:
ferrari = (None, 'Ferrari','The Ferrari')
tesla = [None, 'Tesla', None]

In [10]:
connection.execute('INSERT INTO car_model VALUES (?, ?, ?)', ferrari)

In [11]:
connection.execute('INSERT INTO car_model VALUES (?, ?, ?)',tesla)

## Write a Python function to query a database using pandas and return a DataFrame

In [12]:
def Q(query, db=connection):
    return pd.read_sql(query, db)

## Query the car_names table for all columns where 'Brand' = 'Tesla

In [17]:
Q('SELECT * FROM car_model WHERE car_model."Brand" = "Tesla"')

     Id  Brand Model
0  None  Tesla  None

In [ ]:
Q('select * from car_brand limit 5')

In [ ]:
Q('select * from car_data limit 5')

### Practice INNER JOINs
The most common type of JOIN is `SQL INNER JOIN` (SIMPLE JOIN). A `SQL INNER JOIN` returns all rows from multiple tables in which the JOIN condition is met. 

If we `INNER JOIN` on `Id`, it takes the intersection of the two tables, excluding the rows for which `CustomerID` is NULL in EITHER of the two tables.

Essentially, only matching pairs of Order IDs from both data sets will be returned.

**Select `Make`, `MPG`, `Horsepower`, and `Year`**.
- You will need to `INNER JOIN` the `car_names` and `car_data` tables on the `Id` column.

In [19]:
inner_join = Q('SELECT car_model."Model", car_data."MPG", car_data."Horsepower", car_data."Year" '
'FROM car_model '
'INNER JOIN car_data '
'ON car_model."Id"=car_data."Id"')
inner_join.head()

                         Model   MPG  Horsepower  Year
0  'chevrolet chevelle malibu'  18.0       130.0  1970
1          'buick skylark 320'  15.0       165.0  1970
2         'plymouth satellite'  18.0       150.0  1970
3              'amc rebel sst'  16.0       150.0  1970
4                'ford torino'  17.0       140.0  1970

In [20]:
inner_join.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 4 columns):
Model         406 non-null object
MPG           398 non-null float64
Horsepower    400 non-null float64
Year          406 non-null int64
dtypes: float64(2), int64(1), object(1)
memory usage: 12.8+ KB

### Practice LEFT JOINs

The `LEFT JOIN` keyword returns all rows from the left table (`table1`), along with matching rows in the right table (`table2`). When there is no match, the result is NULL on the right side.

**Select `Make`, `MPG`, `Horsepower`, and `Year`**.
- `SELECT FROM` the `car_names` table.
- `LEFT JOIN` the `car_data` table by `Id`.

In [22]:
left_join = Q('SELECT car_model."Model", car_data."MPG", car_data."Horsepower", car_data."Year" '
'FROM car_model '
'LEFT JOIN car_data '
'ON car_model."Id"=car_data."Id"')
left_join.head()

                         Model   MPG  Horsepower    Year
0  'chevrolet chevelle malibu'  18.0       130.0  1970.0
1          'buick skylark 320'  15.0       165.0  1970.0
2         'plymouth satellite'  18.0       150.0  1970.0
3              'amc rebel sst'  16.0       150.0  1970.0
4                'ford torino'  17.0       140.0  1970.0